04_tests/stress/results/performance-2026-09-02/microservices/hotel-order-run3-k6.stdout.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: hotel-order.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m30s max duration (incl. graceful stop):
              * hotel_order: 1 iterations for each of 50 VUs (maxDuration: 2m0s, gracefulStop: 30s)


Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 100     11.501079/s
    checks_succeeded...: 100.00% 100 out of 100
    checks_failed......: 0.00%   0 out of 100

    ✓ status is 200
    ✓ order created or business-rejected

    CUSTOM
    business_success...............: 1      0.115011/s

    HTTP
    http_req_duration..............: avg=74.11ms  min=16.11ms  med=78.85ms  max=142.3ms  p(90)=104.42ms p(95)=115.26ms
      { expected_response:true }...: avg=74.11ms  min=16.11ms  med=78.85ms  max=142.3ms  p(90)=104.42ms p(95)=115.26ms
    http_req_failed................: 0.00%  0 out of 200
    http_reqs......................: 200    23.002157/s

    EXECUTION
    iteration_duration.............: avg=340.82ms min=278.91ms med=343.55ms max=389.67ms p(90)=370.98ms p(95)=373.67ms
    iterations.....................: 50     5.750539/s
    vus............................: 0      min=0        max=0 
    vus_max........................: 50     min=50       max=50

    NETWORK
    data_received..................: 136 kB 16 kB/s
    data_sent......................: 53 kB  6.1 kB/s



running (0m08.7s), 00/50 VUs, 50 complete and 0 interrupted iterations
hotel_order ✓ [ 100% ] 50 VUs  0m00.4s/2m0s  50/50 iters, 1 per VU